 
//错误处理
var errorcodes={ 
	1001:'账号不存在',
	1002:'密码错误',
	1003:'用户已存在',
	1004:'注册失败',
	1005:'登陆失败',
	1006:'token无效',
	1007:'服务器维护中',
	1008:'token过期',
	1009:'用户不存在',
	1010:'游戏服不存在',
	500:'登陆错误',
	2001:'获取我的信息失败',
	2002:'领取失败',

	3001:'房间已满,请重新匹配',
	3002:'正在游戏中',
	3003:'恢复的游戏已过期',
	3004:'房间已失效,再来一局无效',
	3005:'获取玩家信息失败',
	3006:'创建房间失败',
	3007:'获取房间配置失败',
	3008:'房间已解散,请重新进入',
	3009:'金币不足,请购买金币',
	3010:'金币场匹配验证失败',
	3011:'房间配置不存在',
	3012:'房卡不足',
	3013:'匹配失败',
	3014:'匹配异常',
	3015:'已经在房间中了',
	3016:'房间token已过期', 
	3017:'不在房间中',
	3018:'未经验证,非法进入房间',
	3019:'你已不在房间中',
	3020:'房间类型错误',
	3021:'牌局记录创建失败',
	3022:'房间已过期,结算失败',
	3023:'你有牌局未恢复',
	3024:'你有房间未解散',
	3025:'创建房间异常',
	3026:'房间已解散',
	3027:'需解散房间',
	3028:'非房主无权解散房间',
	3029:'游戏进行中不能解散房间',
	3030:'未找到房间用户信息',
	3031:'非房主无权恢复房间',
	3032:'游戏进行中,无需恢复房间',
	3033:'未发现房间配置',
	3034:'房间不存在',
	3035:'房间场次已结束',
	4001:'此牌不在你手上',
	4002:'未轮到你出手',
	4003:'非法配置',
	5001:'在线人数过多,匹配不到空余房间，请稍后',
	6001:'创建订单失败',
	6002:'订单不存在',
	6003:'订单过期',
	6004:'充值失败',
	6005:'钻石不足',
	6006:'该商品不存在',
	9001:'非法操作',
} 




var err_finishwaterfall=1999
export default class NetCode{ 
	private static _instance = null;
	public static getInstance() : NetCode{
        if (NetCode._instance == null){
            NetCode._instance = new NetCode();
        }
        return NetCode._instance;
    }
	check(code){
		//中断waterfall不算错误
		if (code==err_finishwaterfall){ 
			return null;
		}
		if(code){
			if (code==0){ 
				return null
			}
			var errstr=errorcodes[code];
			var msgstr='错误码=' + code;
			if (errstr){
				msgstr=errstr; 
			}
			return msgstr;
		}
		return null;
	}
}
